### 판다스 학습

In [1]:
import pandas as pd
import numpy as np

In [2]:
score = pd.Series([1000, 14000, 3000, 3000, 1000])

print(score, '\n')
print(type(score))

print(score.index)
print(list(score.index))

print(score.values)
print(score.dtype)

0     1000
1    14000
2     3000
3     3000
4     1000
dtype: int64

<class 'pandas.core.series.Series'>
RangeIndex(start=0, stop=5, step=1)
[0, 1, 2, 3, 4]
[ 1000 14000  3000  3000  1000]
int64

In [3]:
# Series 객체 만들기 (리스트 혹은 딕셔너리, 넘파이 배열을 활용 가능)

weekly_plan = pd.Series(data=["matplotlib study", "pandas study", "numpy study", "titanic study", 
                              "team project","rest", "play"], index=["mon", "tue", "wed", "thu", "fri", "sat", "sun"])
type(weekly_plan)

pandas.core.series.Series

In [4]:
test = dict({"a":1, "b":2, "c":3})
test_series = pd.Series(test)
list(test_series.index)

['a', 'b', 'c']

In [5]:
# 인덱싱과 슬라이싱이 가능하다

weekly_plan[0]
weekly_plan[0][-5:]
weekly_plan[0:2]

mon    matplotlib study
tue        pandas study
dtype: object

In [6]:
# DataFrame 객체 만들기 (딕셔너리를 활용하거나 넘파이 다차원 배열을 활용 가능)

dat = {'col1' : [1, 2, 3, 4],
       'col2' : [10, 20, 30, 40],
       'col3' : ['A', 'B', 'C', 'D']}

df = pd.DataFrame(dat)
df

   col1  col2 col3
0     1    10    A
1     2    20    B
2     3    30    C
3     4    40    D

In [7]:
idx = pd.date_range(start="2021-06-21", end="2021-06-25")
idx

DatetimeIndex(['2021-06-21', '2021-06-22', '2021-06-23', '2021-06-24',
               '2021-06-25'],
              dtype='datetime64[ns]', freq='D')

In [8]:
weekly_plan.values

array(['matplotlib study', 'pandas study', 'numpy study', 'titanic study',
       'team project', 'rest', 'play'], dtype=object)

In [9]:
weekly_plan.index

Index(['mon', 'tue', 'wed', 'thu', 'fri', 'sat', 'sun'], dtype='object')

In [10]:
# df의 개별 행을 선택하는 방법

print(df.iloc[0])
print(df.loc[0])

print(df.iloc[0:2])
print(df.loc[0:2])

col1     1
col2    10
col3     A
Name: 0, dtype: object
col1     1
col2    10
col3     A
Name: 0, dtype: object
   col1  col2 col3
0     1    10    A
1     2    20    B
   col1  col2 col3
0     1    10    A
1     2    20    B
2     3    30    C

In [11]:
# df의 열을 선택하는 방법

print(df["col1"])

print(df[["col1", "col2"]])

0    1
1    2
2    3
3    4
Name: col1, dtype: int64
   col1  col2
0     1    10
1     2    20
2     3    30
3     4    40

In [12]:
df.loc[0, 'col1'] # 0행, col1 열의 값만 가져오기 (loc는 값을 지정)

1

In [13]:
df.iloc[0, 1] # 0행 1열의 값만 가져오기 (iloc는 인덱스 값을 지정)

10

In [14]:
df.loc[:, 'col2']

0    10
1    20
2    30
3    40
Name: col2, dtype: int64

In [15]:
df.iloc[:, 0]

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [16]:
idx = pd.date_range(start="2021-06-21", end="2021-06-25")
team_score = { "toto":[1500,3000,5000,7000,5500],
              "apple":[4000,5000,6000,5500,4500],
              "gildong":[2000,2500,3000,4000,3000],
              "catanddog":[7000,5000,3000,5000,4000]}
team_df = pd.DataFrame(team_score, index=idx)
team_df

            toto  apple  gildong  catanddog
2021-06-21  1500   4000     2000       7000
2021-06-22  3000   5000     2500       5000
2021-06-23  5000   6000     3000       3000
2021-06-24  7000   5500     4000       5000
2021-06-25  5500   4500     3000       4000

In [17]:
print(type(team_df.loc[:, "toto"]))
team_df.loc[:, "toto"]

<class 'pandas.core.series.Series'>

2021-06-21    1500
2021-06-22    3000
2021-06-23    5000
2021-06-24    7000
2021-06-25    5500
Freq: D, Name: toto, dtype: int64

In [18]:
type(team_df.loc[:, "toto":"apple"])
team_df.loc[:, "toto":"apple"]

            toto  apple
2021-06-21  1500   4000
2021-06-22  3000   5000
2021-06-23  5000   6000
2021-06-24  7000   5500
2021-06-25  5500   4500

In [19]:
# 1행 가져오기

print(team_df.loc['2021-06-21'])
print(team_df.iloc[0])

# 여러행 가져오기

print(team_df.loc['2021-06-21':'2021-06-24'])
print(team_df.iloc[0:3])

# 1열 가져오기

print(team_df.loc[: ,"toto"])
print(team_df.iloc[:, 0])

# 여러열 가져오기

print(team_df.loc[:, "toto":"catanddog"])
print(team_df.iloc[:, 0:])

toto         1500
apple        4000
gildong      2000
catanddog    7000
Name: 2021-06-21 00:00:00, dtype: int64
toto         1500
apple        4000
gildong      2000
catanddog    7000
Name: 2021-06-21 00:00:00, dtype: int64
            toto  apple  gildong  catanddog
2021-06-21  1500   4000     2000       7000
2021-06-22  3000   5000     2500       5000
2021-06-23  5000   6000     3000       3000
2021-06-24  7000   5500     4000       5000
            toto  apple  gildong  catanddog
2021-06-21  1500   4000     2000       7000
2021-06-22  3000   5000     2500       5000
2021-06-23  5000   6000     3000       3000
2021-06-21    1500
2021-06-22    3000
2021-06-23    5000
2021-06-24    7000
2021-06-25    5500
Freq: D, Name: toto, dtype: int64
2021-06-21    1500
2021-06-22    3000
2021-06-23    5000
2021-06-24    7000
2021-06-25    5500
Freq: D, Name: toto, dtype: int64
            toto  apple  gildong  catanddog
2021-06-21  1500   4000     2000       7000
2021-06-22  3000   5000     2500       5000
2021-06-23  5000   6000     3000       3000
2021-06-24  7000   5500     4000       5000
2021-06-25  5500   4500     3000       4000
            toto  apple  gildong  catanddog
2021-06-21  1500   4000     2000       7000
2021-06-22  3000   5000     2500       5000
2021-06-23  5000   6000     3000       3000
2021-06-24  7000   5500     4000       5000
2021-06-25  5500   4500     3000       4000

In [20]:
# df의 기초 통계정보

print(team_df.sum(axis=0)) # 행 별 값을 더해서 결과값을 보여준다 -> 결과값은 열 마다 하나씩 나온다
print(team_df.sum(axis=1)) # 열 별 값을 더해서 결과값을 보여준다 -> 결과값은 행 마다 하나씩 나온다

toto         22000
apple        25000
gildong      14500
catanddog    24000
dtype: int64
2021-06-21    14500
2021-06-22    15500
2021-06-23    17000
2021-06-24    21500
2021-06-25    17000
Freq: D, dtype: int64

In [21]:
team_df

            toto  apple  gildong  catanddog
2021-06-21  1500   4000     2000       7000
2021-06-22  3000   5000     2500       5000
2021-06-23  5000   6000     3000       3000
2021-06-24  7000   5500     4000       5000
2021-06-25  5500   4500     3000       4000

In [22]:
print(team_df.mean(axis=0)) # 행 별 값들의 평균을 계산한다 -> 결과값은 열 마다 하나씩 나온다
print(team_df.mean(axis=1)) # 열 별 값들의 평균을 계산한다 -> 결과값은 행 마다 하나씩 나온다

toto         4400.0
apple        5000.0
gildong      2900.0
catanddog    4800.0
dtype: float64
2021-06-21    3625.0
2021-06-22    3875.0
2021-06-23    4250.0
2021-06-24    5375.0
2021-06-25    4250.0
Freq: D, dtype: float64

In [23]:
team_df.describe()

              toto        apple      gildong    catanddog
count     5.000000     5.000000     5.000000     5.000000
mean   4400.000000  5000.000000  2900.000000  4800.000000
std    2162.174831   790.569415   741.619849  1483.239697
min    1500.000000  4000.000000  2000.000000  3000.000000
25%    3000.000000  4500.000000  2500.000000  4000.000000
50%    5000.000000  5000.000000  3000.000000  5000.000000
75%    5500.000000  5500.000000  3000.000000  5000.000000
max    7000.000000  6000.000000  4000.000000  7000.000000

In [24]:
team_df.cumsum()

             toto  apple  gildong  catanddog
2021-06-21   1500   4000     2000       7000
2021-06-22   4500   9000     4500      12000
2021-06-23   9500  15000     7500      15000
2021-06-24  16500  20500    11500      20000
2021-06-25  22000  25000    14500      24000

In [25]:
team_df['row_sum'] = team_df.sum(axis=1) # 각 열의 값을 더해서 나온 결과값을 row_sum 열에 저장
team_df

            toto  apple  gildong  catanddog  row_sum
2021-06-21  1500   4000     2000       7000    14500
2021-06-22  3000   5000     2500       5000    15500
2021-06-23  5000   6000     3000       3000    17000
2021-06-24  7000   5500     4000       5000    21500
2021-06-25  5500   4500     3000       4000    17000

In [26]:
team_df.loc['column_sum'] = team_df.sum(axis=0) # 각 행의 값을 더해서 나온 결과값을 column_sum 행에 저장
team_df

                      toto  apple  gildong  catanddog  row_sum
2021-06-21 00:00:00   1500   4000     2000       7000    14500
2021-06-22 00:00:00   3000   5000     2500       5000    15500
2021-06-23 00:00:00   5000   6000     3000       3000    17000
2021-06-24 00:00:00   7000   5500     4000       5000    21500
2021-06-25 00:00:00   5500   4500     3000       4000    17000
column_sum           22000  25000    14500      24000    85500

In [27]:
team_df['row_sum'].sort_values(ascending=False) # 내림차순으로 row_sum 열 값을 기준으로 정렬

column_sum             85500
2021-06-24 00:00:00    21500
2021-06-23 00:00:00    17000
2021-06-25 00:00:00    17000
2021-06-22 00:00:00    15500
2021-06-21 00:00:00    14500
Name: row_sum, dtype: int64

In [28]:
team_df['row_sum'] >= 17000 # 조건식은 boolean index 객체를 반환한다

2021-06-21 00:00:00    False
2021-06-22 00:00:00    False
2021-06-23 00:00:00     True
2021-06-24 00:00:00     True
2021-06-25 00:00:00     True
column_sum              True
Name: row_sum, dtype: bool

In [29]:
team_df[team_df['row_sum'] >= 17000] # df에 조건식으로 반환된 인덱스 객체를 넣으면 조건식에 해당하는 행 반환

                      toto  apple  gildong  catanddog  row_sum
2021-06-23 00:00:00   5000   6000     3000       3000    17000
2021-06-24 00:00:00   7000   5500     4000       5000    21500
2021-06-25 00:00:00   5500   4500     3000       4000    17000
column_sum           22000  25000    14500      24000    85500

In [30]:
team_df[team_df['row_sum'] >= 17000].loc["column_sum"]

toto         22000
apple        25000
gildong      14500
catanddog    24000
row_sum      85500
Name: column_sum, dtype: int64

In [31]:
team_df.drop(['toto', 'gildong'], axis=1)

                     apple  catanddog  row_sum
2021-06-21 00:00:00   4000       7000    14500
2021-06-22 00:00:00   5000       5000    15500
2021-06-23 00:00:00   6000       3000    17000
2021-06-24 00:00:00   5500       5000    21500
2021-06-25 00:00:00   4500       4000    17000
column_sum           25000      24000    85500

In [32]:
team_df

                      toto  apple  gildong  catanddog  row_sum
2021-06-21 00:00:00   1500   4000     2000       7000    14500
2021-06-22 00:00:00   3000   5000     2500       5000    15500
2021-06-23 00:00:00   5000   6000     3000       3000    17000
2021-06-24 00:00:00   7000   5500     4000       5000    21500
2021-06-25 00:00:00   5500   4500     3000       4000    17000
column_sum           22000  25000    14500      24000    85500

In [33]:
# 합계 점수가 1등 2등만 선택해보자

team_df.loc["column_sum"].sort_values(axis=0, ascending=False).iloc[:2]

row_sum    85500
apple      25000
Name: column_sum, dtype: int64

In [34]:
# 실습 1-1

dat = { "순위":[1,2,3,4],
        "연속":[2,1,1,1],
        "누적":[2,3,2,4],
        "종목명":["솔고바이오", "한세엠케이", "네오오토", "엄지하우스"],
        "현재가":[933,9490, 9990, 4885],
        "전일비":[229, 2190, 2300, 635],
        "등락률":[29.97, 30.00, 29.91, 14.94],
        "거래량":[4657527, 19568672, 3157505, 7231]}
dat_df = pd.DataFrame(dat)
dat_df

   순위  연속  누적    종목명   현재가   전일비    등락률       거래량
0   1   2   2  솔고바이오   933   229  29.97   4657527
1   2   1   3  한세엠케이  9490  2190  30.00  19568672
2   3   1   2   네오오토  9990  2300  29.91   3157505
3   4   1   4  엄지하우스  4885   635  14.94      7231

In [35]:
# 실습 1-2

# 날짜 인덱스

date_index = list(pd.date_range(start="2021-06-24", end="2021-06-27"))
dat_df.index = date_index
dat_df

            순위  연속  누적    종목명   현재가   전일비    등락률       거래량
2021-06-24   1   2   2  솔고바이오   933   229  29.97   4657527
2021-06-25   2   1   3  한세엠케이  9490  2190  30.00  19568672
2021-06-26   3   1   2   네오오토  9990  2300  29.91   3157505
2021-06-27   4   1   4  엄지하우스  4885   635  14.94      7231

In [36]:
# 실습 1-3

# 4행 선택
print(dat_df.iloc[-1])

# 2-3행 선택
dat_df.iloc[1:3]

순위         4
연속         1
누적         4
종목명    엄지하우스
현재가     4885
전일비      635
등락률    14.94
거래량     7231
Name: 2021-06-27 00:00:00, dtype: object

            순위  연속  누적    종목명   현재가   전일비    등락률       거래량
2021-06-25   2   1   3  한세엠케이  9490  2190  30.00  19568672
2021-06-26   3   1   2   네오오토  9990  2300  29.91   3157505

In [37]:
# 실습 1-4

 # 2, 3행 선택하기
dat_df.loc["2021-06-25":"2021-06-26"]

# 4행 선택하기
dat_df.loc["2021-06-27"]

순위         4
연속         1
누적         4
종목명    엄지하우스
현재가     4885
전일비      635
등락률    14.94
거래량     7231
Name: 2021-06-27 00:00:00, dtype: object

In [38]:
# 실습 1-5

# 2행 2열부터 3행 3열까지 선택해보기

dat_df.loc["2021-06-25":"2021-06-26", "연속":"누적"]

            연속  누적
2021-06-25   1   3
2021-06-26   1   2

2